Repository: openforis/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/index.po
Languages: fr

source: Getting started
fr: Premiers pas

source: Cookbook
fr: Recettes

source: Features
fr: Fonctionnalités

source: SEPAL (System for Earth Observation Data Access, Processing and Analysis for Land Monitoring) is an open-source project and platform empowering people around the world to gain a better understanding of land cover dynamics by facilitating the efficient access and use of Earth observation data – without the need of coding knowledge.
fr: SEPAL (Système d'accès aux données d'observation de la Terre, Le traitement et l'analyse de l'observation des terres) est un projet et une plate-forme open-source qui permet aux gens du monde entier de mieux comprendre la dynamique de la couverture terrestre en facilitant l'accès et l'utilisation efficaces des données d'observation de la Terre - sans avoir besoin de connaissances en codage.

source: Learn how to use the platform with SEPAL documentation
fr: Apprenez à utiliser la plateforme avec la documentation SEPAL

source: The SEPAL team developed this GitHub page to help users get the most out of the interface.
fr: L'équipe SEPAL a développé cette page GitHub pour aider les utilisateurs à tirer le meilleur parti de l'interface.

source: Register to SEPAL
fr: S'inscrire sur SEPAL

source: Set up your SEPAL account and request additional resources.
fr: Configurez votre compte SEPAL et demandez des ressources supplémentaires.

source: Connect to GEE
fr: Se connecter à GEE

source: Register with Google Earth Engine (GEE) and connect your account to SEPAL.
fr: Enregistrez-vous avec Google Earth Engine (GEE) et connectez votre compte à SEPAL.

source: Connect to NICFI PlanetLab imagery
fr: Se connecter aux images NICFI PlanetLab

source: Sign up to use Norway’s International Climate and Forests Initiative (NICFI) – PlanetLab data and connect your account to GEE.
fr: Inscrivez-vous pour utiliser les données de l’Initiative internationale sur le climat et les forêts de Norvège (NICFI) – PlanetLab et connecter votre compte à GEE.

source: Recipes and modules
fr: Recettes et modules

source: Start a recipe.
fr: Démarrer une recette.

source: Run analysis with recipes, the foundation of SEPAL processes.
fr: Exécutez des analyses avec des recettes, la base des processus SEPAL.

source: Start a module.
fr: Démarrer un module.

source: Run integrated workflows with modules – no need of coding experience required.
fr: Exécutez des workflows intégrés avec des modules – pas besoin d'expérience de développement numérique nécessaire.

source: Use the se.plan module.
fr: Utilisez le module se.plan.

source: Compute your restoration index with se.plan, a spatially explicit online tool designed to support forest restoration planning decisions by restoration stakeholders.
fr: Calculez votre index de restauration avec se.plan, un outil en ligne spatialement explicite conçu pour soutenir les décisions de planification de la restauration forestière par les parties prenantes à la restauration.

source: Other resources
fr: Autres ressources

source: SEPAL website
fr: Site web SEPAL

source: Discover the impact of the project.
fr: Découvrez l'impact du projet.

source: SEPAL platform
fr: Plateforme SEPAL

source: Learn more about the interface.
fr: En savoir plus sur l'interface.

source: Browse the Suite of Tools.
fr: Naviguez dans la suite d'outils.

source: SEPAL is always improving.
fr: SEPAL est en constante amélioration.

source: Encounter a problem? See an issue? Need help? Take one of the following actions to help our team members enhance user experience by improving the platform and its documentation.
fr: Vous rencontrez un problème ? Vous avez besoin d'aide ? Prenez l'une des actions suivantes pour aider les membres de notre équipe à améliorer l'expérience utilisateur en améliorant la plate-forme et la documentation.

source: For general support, ask the Google Group community.
fr: Pour des questions d'utilisation, demandez à la communauté du Groupe Google.

source: For documentation improvement, use the GitHub Issue Tracker.
fr: Pour améliorer la documentation, utilisez le gestionnaire de tickets GitHub.

source: For usage questions, ask the GIS StackExchange community.
fr: Pour des questions d'utilisation, posez des questions à la communauté SIG sur StackExchange.

source: For training, register for an online facilitated course from the FAO elearning Academy.
fr: Pour une formation, inscrivez-vous à un cours en ligne facilité par l’Académie d’elearning de la FAO.

source: About the platform
fr: À propos de la plateforme

source: SEPAL is part of the `Open Foris <http://www.openforis.org>`__ Suite of Tools. The platform allows users to query and process satellite data quickly and efficiently, tailor their products for local needs, and produce sophisticated and relevant geospatial analyses. Harnessing cloud-based supercomputers and modern geospatial data infrastructures (e.g. GEE), the interface enables access and processing of historical satellite data as well as newer data from Landsat and higher-resolution data from Europe’s Copernicus program.
fr: SEPAL fait partie de la suite d'outils `Open Foris <http://www.openforis.org>`__. La plateforme permet aux utilisateurs d' interroger et de traiter les données par satellite rapidement et efficacement, adapter leurs produits aux besoins locaux et produire des analyses géospatiales sophistiquées et pertinentes. Exploiter les superordinateurs dans le cloud et les infrastructures de données géospatiales modernes (p. ex. GEE), l’interface permet l’accès et le traitement des données historiques satellitaires ainsi que des données plus récentes provenant de Landsat et des données de plus haute résolution du programme Copernicus en Europe.

source: SEPAL is a cloud computing-based platform for autonomous land monitoring using remotely sensed data. It is a combination of GEE and open-source software such as GDAL, Jupyter, the Open Foris Geospatial Toolkit, ORFEO Toolbox, Python, R, R Shiny Server, R Studio Server, and SNAP Toolkit. The platform allows users to access powerful cloud-computing resources to query, access and process satellite data quickly and efficiently for creating advanced analyses.
fr: SEPAL est une plate-forme basée sur l'informatique dans le cloud pour la surveillance autonome des terres en utilisant des données à distance sensées. Il s'agit d'une combinaison de GEE et de logiciels open-source tels que GDAL, Jupyter, l'Open Foris Geospatial Toolkit, Boîte à outils ORFEO, Python, R, R Shiny Server, R Studio Server et SNAP Toolkit. La plateforme permet aux utilisateurs d'accéder rapidement et efficacement à des ressources informatiques puissantes pour interroger et traiter les données satellitaires afin de créer des analyses avancées.

source: Supporting institutions
fr: Institutions partenaires

source: SEPAL is a project funded by the Government of Norway from the Forestry Department of the Food and Agriculture Organization of the United Nations (FAO).
fr: SEPAL est un projet financé par le gouvernement norvégien du Département des forêts de l'Organisation des Nations Unies pour l'alimentation et l'agriculture (FAO).
