Repository: openforis/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/cli/python.po
Languages: fr_fr

source: Usage
fr_fr: Utilisation

source: SEPAL instances run on :code:`focal` Ubuntu machines and thus provide a fully functional :code:`Python 3.8` environment. This environment is accessible through Jupyter Notebook, JupyterLab or the terminal:
fr_fr: Les instances SEPAL fonctionnent sur des machines Ubuntu :code:`focal` et fournissent donc un environement :code:`Python 3.8`. Cet environnement est accessible via Jupyter Notebook, JupyterLab ou le terminal:

source: The SEPAL Python environment is not empty; there are numerous embedded librairies (see figure below).
fr_fr: L'environnement SEPAL Python n'est pas vide ; il y a de nombreuses librairies embarquées (voir figure ci-dessous).

source: Run :code:`pip show <name of your lib>` to check if it's already installed.
fr_fr: Exécutez :code:`pip show <name of your lib>` pour vérifier si elle est déjà installée.

source: Customization
fr_fr: Personnalisation

source: The SEPAL environment can be customized to user needs using any third-party librairies and pip. By default installation will be run in :code:`--user` mode and won't affect other SEPAL users.
fr_fr: L'environnement SEPAL peut être personnalisé en fonction des besoins des utilisateurs en utilisant n'importe quelle librairie tierce et pip. Par défaut, l'installation sera exécutée en mode :code:`--user` et n'affectera pas les autres utilisateurs de SEPAL.

source: If you face compatibility issues when customizing your SEPAL environment, please let us know in the `Github issue tracker <https://github.com/openforis/sepal/issues/new/choose>`__.
fr_fr: Si vous rencontrez des problèmes de compatibilité lors de la personnalisation de votre environnement SEPAL, veuillez nous le faire savoir dans le `GitHub issue tracker <https://github.com/openforis/sepal/issues/new/choose>`__.

source: Virtual environment
fr_fr: Environnement virtuel

source: SEPAL does not support conda environments. If you need to install compiled libraries, please contact the SEPAL team via the `Github issue tracker <https://github.com/openforis/sepal/issues/new/choose>`__.
fr_fr: SEPAL ne prend pas en charge les environnements de conda. Si vous avez besoin d'installer des bibliothèques compilées, veuillez contacter l'équipe SEPAL via le `Github issue tracker <https://github.com/openforis/sepal/issues/new/choose>`__.

source: SEPAL supports Python venv creation. In this section, we'll explain how to create a venv and link it to Jupyter, so you can run your processes on the associated kernel.
fr_fr: SEPAL supporte la création de venv Python. Dans cette section, nous allons expliquer comment créer un venv et le lier à Jupyter, afin que vous puissiez exécuter vos processus sur le noyau associé.

source: By design, Jupyter is running on the Python Kernel described in the previous section. You can also use the kernel associated with our applications (they start with :code:`venv`). If your work relies on very specific version numbers, it might be good to run everything in a dedicated environment.
fr_fr: Par conception, Jupyter fonctionne sur le noyau Python décrit dans la section précédente. Vous pouvez également utiliser le noyau associé à nos applications (elles commencent par :code:`venv`). Si votre travail repose sur des numéros de version très spécifiques, il est peut-être bon de tout exécuter dans un environnement dédié.

source: If not existing, create a directory to host your virtual environments. From the root directory, run the following line:
fr_fr: S'il n'existe pas, créez un répertoire pour héberger vos environnements virtuels. À partir du répertoire racine, exécutez la ligne suivante :

source: Then, copy and paste the following lines in your terminal:
fr_fr: Ensuite, copiez et collez les lignes suivantes dans votre terminal :

source: Now, this venv will be available as a kernel inside your Jupyter workspace. It will be automatically removed if you destroy the venv directory.
fr_fr: Maintenant, ce venv sera disponible en tant que noyau dans votre espace de travail Jupyter. Il sera automatiquement supprimé si vous détruisez le répertoire venv.

source: Note that if you want to install libs inside of this venv, you first need to activate it:
fr_fr: Notez que si vous voulez installer des libs à l'intérieur de ce venv, vous devez d'abord l'activer :
