Repository: openforis/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/setup/filezilla.po
Languages: fr_fr

source: Exchange files with SEPAL
fr_fr: Échanger des fichiers avec SEPAL

source: Use SEPAL's built-in tools and FTP solutions to exhange files
fr_fr: Utiliser les outils intégrés de SEPAL et les solutions FTP pour échanger des fichiers

source: In this article, you can learn how to exchange files with SEPAL using:
fr_fr: Dans cet article, vous pouvez apprendre à échanger des fichiers avec SEPAL en utilisant :

source: Built-in tools, including: - Jupytyr Notebook - Jupityrlab - RStudio - SEPAL file explorer
fr_fr: Outils intégrés, y compris : - Jupyter Notebook- Jupityrlab- RStudio- Explorateur de fichiers SEPAL

source: an FTP solution, specifically FileZilla®
fr_fr: une solution FTP, spécifiquement FileZilla®

source: Built-in tools
fr_fr: Outils intégrés

source: To exchange files with SEPAL, there are several built-in tools you can use.
fr_fr: Pour échanger des fichiers avec SEPAL, il existe plusieurs outils intégrés que vous pouvez utiliser.

source: Since SEPAL's built-in tools for uploading and downloading are limited, large amounts of data should be uploaded or downloaded using an FTP solution, such as FileZilla® (for more information, see the section "FTP solution" below).
fr_fr: Comme les outils intégrés de SEPAL pour le téléchargement et le téléchargement sont limités, les grandes quantités de données doivent être téléchargées ou téléchargées à l'aide d'une solution FTP, comme FileZilla® (pour plus d'informations, voir la section "Solution FTP" ci-dessous).

source: In the SEPAL **Application** dashboard, open a new **Jupyter Notebook app**. The **Notebook** dashboard enables you to access files and directories on your system, which can be opened, created, deleted, renamed, downloaded, copied and shared.
fr_fr: Dans le tableau de bord SEPAL **Application**, ouvrez une nouvelle **application Jupyter Notebook**. Le tableau de bord **Notebook** vous permet d'accéder aux fichiers et répertoires de votre système, qui peuvent être ouverts, créés, supprimés, renommés, téléchargés, copiés et partagés.

source: Select **Upload** to upload a file from your computer to the platform.
fr_fr: Sélectionnez **Télécharger** pour télécharger un fichier de votre ordinateur vers la plate-forme.

source: Select **Download** to download a selected file to your computer.
fr_fr: Sélectionnez **Télécharger** pour télécharger un fichier sélectionné sur votre ordinateur.

source: **Download** is only available when you click on a single file (Note: folders can not be downloaded).
fr_fr: **Téléchargement** n'est disponible que lorsque vous cliquez sur un seul fichier (Note : les dossiers ne peuvent pas être téléchargés).

source: In the SEPAL interface **Dashboard**, open a new **Jupyterlab app**.
fr_fr: Dans l'interface SEPAL **Tableau de bord**, ouvrez une nouvelle **application Jupyterlab**.

source: Use the **File browser** and **File menu** to access files and directories on your system, which can be opened, created, deleted, renamed, downloaded, copied and shared.
fr_fr: Utilisez le **Navigateur de fichiers** et **Menu de fichiers** pour accéder aux fichiers et répertoires de votre système, qui peuvent être ouverts, créés, supprimés, renommés, téléchargés, copiés et partagés.

source: Upload files to the **File browser** directory by dragging and dropping, or by selecting **Upload files** at the top of the **File browser**:
fr_fr: Téléversez des fichiers dans le répertoire **File browser** par glisser-déposer, ou en sélectionnant **Upload files** en haut du **File browser**:

source: Any file in Jupyterlab can be downloaded by right-clicking its name in the **File browser** and selecting **Download** from the context menu:
fr_fr: N'importe quel fichier dans Jupyterlab peut être téléchargé en cliquant avec le bouton droit de la souris sur son nom dans le **navigateur de fichiers** et en sélectionnant **Télécharger** dans le menu contextuel :

source: More information about the Jupyterlab interface can be found in `Jupyterlab documentation <https://Jupyterlab.readthedocs.io/en/stable/getting_started/overview.html>`__.
fr_fr: Plus d'informations sur l'interface Jupyterlab peuvent être trouvées dans la `documentation Jupyterlab <https://Jupyterlab.readthedocs.io/en/stable/getting_started/overview.html>`__.

source: In the SEPAL interface **Dashboard**, open a new **RStudio app**.
fr_fr: Dans l'interface SEPAL **Tableau de bord**, ouvrez une nouvelle **application RStudio**.

source: Use the **File menu** (in red in the yellow image below) to access files and directories on your system, which can be opened, created, deleted, renamed and copied.
fr_fr: Utilisez le **Menu Fichier** (en rouge dans l'image jaune ci-dessous) pour accéder aux fichiers et répertoires sur votre système, qui peuvent être ouvertes, créées, supprimées, renommées et copiées.

source: Upload files from your computer by selecting **Upload** in the upper-left of the red rectangle.
fr_fr: Téléchargez des fichiers depuis votre ordinateur en sélectionnant **Télécharger** en haut à gauche du rectangle rouge.

source: SEPAL file explorer
fr_fr: Explorateur de fichiers SEPAL

source: In the SEPAL **File explorer**, you will be able to access files and directories on your system, which can be deleted and downloaded.
fr_fr: Dans l'**Explorateur de fichiers** de SEPAL, vous pourrez accéder aux fichiers et répertoires de votre système, qui peuvent être supprimés et téléchargés.

source: After selecting a single file, select **Download** to download the file to your local folder.
fr_fr: Après avoir sélectionné un seul fichier, sélectionnez **Télécharger** pour télécharger le fichier dans votre dossier local.

source: You cannot download multiple files or folders directly through this interface.
fr_fr: Vous ne pouvez pas télécharger plusieurs fichiers ou dossiers directement via cette interface.

source: FTP solution
fr_fr: Solution FTP

source: SEPAL content can also be accessed via a Secure Shell (SSH) File Transfer Protocol (FTP).
fr_fr: Le contenu de SEPAL est également accessible via un protocole de transfert de fichiers (SSH) (STP).

source: You must request user resources in order for any FTP solution to connect to SEPAL. Follow the steps described in :doc:`./resource` for more information.
fr_fr: Vous devez demander des ressources utilisateur pour qu'une solution FTP se connecte à SEPAL. Suivez les étapes décrites dans :doc:`./resource` pour plus d'informations.

source: If you don't know what an FTP solution is and/or don't have an FTP solution installed on your computer, you can learn more by reading this section, where FileZilla is used as an example.
fr_fr: Si vous ne savez pas ce qu'est une solution FTP et/ou si vous n'avez pas de solution FTP installée sur votre ordinateur, vous pouvez en apprendre plus en lisant cette section, où FileZilla est utilisé comme exemple.

source: An FTP client is software that allows you to connect to an FTP server in order to exchange files. Once connected, you can upload, download, copy or delete files on either the remote computer or your local computer.
fr_fr: Un client FTP est un logiciel qui vous permet de vous connecter à un serveur FTP pour échanger des fichiers. Une fois connecté, vous pouvez télécharger, copier ou supprimer des fichiers sur l'ordinateur distant ou votre ordinateur local.

source: FileZilla® is a free, open-source FTP solution distributed free of charge under the terms of the `GNU General Public License <https://www.gnu.org/licenses/gpl-3.0.en.html>`_.
fr_fr: FileZilla® est une solution FTP gratuite et open-source distribuée gratuitement selon les termes de la `GNU General Public License <https://www.gnu.org/licenses/gpl-3.0.en.html>`_.

source: The FileZilla Client not only supports FTP, but also FTP over Transport Layer Security (TLS) – FTPS – and Secure File Transfer Protocol (SFTP), both used in SEPAL.
fr_fr: Le client FileZilla ne prend pas seulement en charge FTP, mais aussi FTP over Transport Layer Security (TLS) – FTPS – et Secure File Transfer Protocol (SFTP), tous deux utilisés dans SEPAL.

source: To download the software, go to `<https://FileZilla-project.org/download.php?type=client>`_.
fr_fr: Pour télécharger le logiciel, allez à `<https://FileZilla-project.org/download.php?type=client>`_.

source: Connect your FTP client to SEPAL
fr_fr: Connectez votre client FTP à SEPAL

source: Accessing files in SEPAL is easy using FileZilla.
fr_fr: L'accès aux fichiers dans SEPAL est facilité grâce à FileZilla.

source: To use FileZilla, open the application and connect to the SEPAL server by selecting **Menu** > **File** > **Site Manager** >> **New Site**.
fr_fr: Pour utiliser FileZilla, ouvrez l'application et connectez-vous au serveur SEPAL en sélectionnant **Menu** > **Fichier** > **Gestionnaire de sites** >> **Nouveau site**.

source: Use the screenshot below as a guide for filling out the form:
fr_fr: Utilisez la capture d'écran ci-dessous comme guide pour remplir le formulaire :

source: **Host:** ssh.sepal.io
fr_fr: **Hôte :** ssh.sepal.io

source: **Protocol:** SFTP – SSH File Transfer Protocol
fr_fr: **Protocole :** SFTP – SSH File Transfer Protocol

source: **Logon Type:** Normal
fr_fr: **Type de connexion :** Normal

source: **User:** <your SEPAL username>
fr_fr: **Utilisateur:** <votre nom d'utilisateur SEPAL>

source: **Password:** <your SEPAL password>
fr_fr: **Mot de passe :** <votre mot de passe SEPAL>

source: For **User** and **Password**, enter the credentials you use to connect to the platform.
fr_fr: Pour **Utilisateur** et **Mot de passe**, entrez les identifiants que vous utilisez pour vous connecter à la plateforme.

source: By selecting **Connect**, your SEPAL drive will appear in the right pane.
fr_fr: En sélectionnant **Connecter**, votre lecteur SEPAL apparaîtra dans le panneau de droite.

source: In the left pane, you can find files and folders on your computer.
fr_fr: Dans le volet gauche, vous pouvez trouver des fichiers et des dossiers sur votre ordinateur.

source: Use the FTP client to interact with SEPAL
fr_fr: Utiliser le client FTP pour interagir avec SEPAL

source: Familiarize yourself with FileZilla's window layout by following this overview:
fr_fr: Familiarisez-vous avec la mise en page de FileZilla en suivant cette vue d'ensemble :

source: Below the **Toolbar** (1) and **Quick connect bar** (2), the **Message log** (3) displays messages related to transfers and connection. Below, you can find the file listings. The left column (**Local pane**, 4) displays the local files and directories (e.g. content on the PC you're using FileZilla on). The right column (**Remote pane**, 5) displays the files and directories on the server you are connected to. Both columns have a directory tree at the top and a detailed listing of the currently selected directory's contents at the bottom. You can easily navigate either of the trees and lists by clicking around, like you would in any other file manager. In the lower section of the window, the **Transfer queue** (6) lists the status of to-be-tranferred or already transfered files.
fr_fr: Sous la **Barre d'outils** (1) et la **Barre de connexion rapide** (2), le **Journal des messages** (3) affiche les messages relatifs aux transferts et à la connexion. Ci-dessous, vous pouvez trouver les listes de fichiers. La colonne de gauche (**volet local**, 4) affiche les fichiers et répertoires locaux (par exemple, le contenu sur le PC sur lequel vous utilisez FileZilla). La colonne de droite (**Panneau distant**, 5) affiche les fichiers et répertoires sur le serveur auquel vous êtes connecté. Les deux colonnes ont une arborescence de répertoires en haut et une liste détaillée du contenu du répertoire actuellement sélectionné en bas de page. Vous pouvez facilement naviguer dans l'un des arbres et des listes en cliquant autour, comme vous le feriez dans n'importe quel autre gestionnaire de fichiers. Dans la partie inférieure de la fenêtre, la **file de transfert** (6) liste l'état des fichiers à transférer ou déjà transférés.

source: For more information on using FileZilla, go to their `wiki page <https://wiki.FileZilla-project.org/FileZilla_Client_Tutorial_(en)>`__.
fr_fr: Pour plus d'informations sur l'utilisation de FileZilla, allez sur leur `page wiki <https://wiki.FileZilla-project.org/FileZilla_Client_Tutorial_(en)>`__.
