Repository: openforis/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/setup/resource.po
Languages: fr_fr

source: Manage your resources
fr_fr: Gérer vos ressources

source: Monitor usage and request resources
fr_fr: Surveiller l'utilisation et la demande de ressources

source: In this article, you can learn how to:
fr_fr: Dans cet article, vous pouvez apprendre à :

source: -Understand your **User report** -Manage instances -Request resources
fr_fr: -Comprendre votre **rapport utilisateur** -Gérer les instances -Demander des ressources

source: SEPAL provides free access to computation resources that are shared among registered users. To prevent exportation mistakes, new users are granted few resources that are sufficient for discovering the functionalities and running sub-regional analysis. By default, instances are closed automatically when they are not being used.
fr_fr: SEPAL fournit un accès gratuit aux ressources de calcul qui sont partagées entre les utilisateurs enregistrés. Pour éviter les erreurs d'exportation, les nouveaux utilisateurs reçoivent des ressources limitées suffisantes pour découvrir les fonctionnalités et exécuter l'analyse sous-régionale. Par défaut, les instances sont fermées automatiquement lorsqu'elles ne sont pas utilisées.

source: The SEPAL user starter pack includes:
fr_fr: Le pack de démarrage de l'utilisateur SEPAL comprend:

source: 0 USD/month of instance spending
fr_fr: 0 USD/mois de dépense d'instance

source: 0 USD/month of storage spending
fr_fr: 0 USD/mois de dépense de stockage

source: 0 Gb of storage
fr_fr: 0 Go de stockage

source: Some actions or projects may require more storage to perform analysis at the province or country level; other actions or projects may require more instances to perform heavier computation processes. If you need more storage or instances, you can submit a quota request to the SEPAL team by following the instructions below.
fr_fr: Certaines actions ou projets peuvent nécessiter plus de stockage pour effectuer des analyses au niveau de la province ou du pays ; d'autres actions ou projets peuvent nécessiter plus d'instances pour effectuer des processus de calcul plus intenses. Si vous avez besoin de plus de stockage ou d'instances, vous pouvez soumettre une demande de quota à l'équipe SEPAL en suivant les instructions ci-dessous.

source: Since quota requests are reviewed on a case-by-case basis, response time may vary.
fr_fr: Comme les demandes de quotas sont examinées au cas par cas, le temps de réponse peut varier.

source: User report
fr_fr: Rapport utilisateur

source: In **Terminal**, **Applications** or **Recipes**, select **User report** on the lower-right side of the window to see your current instance consumption: :btn:`<fas fa-dollar-sign> x.xx/h`.
fr_fr: Dans le **Terminal**, **Applications** ou **Recettes**, sélectionnez **Rapport d'utilisateur** sur le côté inférieur droit de la fenêtre pour voir votre consommation d'instance actuelle: :btn:`<fa-solid fa-dollar-sign> x.xx/h`.

source: After selecting this button, the **Resource management** pop-up window will appear, displaying the current consumption of all of your resources expressed in percentages (1) (Note: a full bar indicates that you have reached one of your monthly quotas) and instances that are currently running (2).
fr_fr: Après avoir sélectionné ce bouton, la fenêtre pop-up **Gestion des ressources** apparaîtra affichant la consommation actuelle de toutes vos ressources exprimées en pourcentages (1) (Note : une barre complète indique que vous avez atteint l'un de vos quotas) et des instances qui fonctionnent actuellement (2).

source: You can request additional resources by selecting the green button.
fr_fr: Vous pouvez demander des ressources supplémentaires en cliquant sur le bouton vert.

source: Manage instances
fr_fr: Gérer une instance

source: Amazon Web Services (AWS) instances can be managed from this interface as well.
fr_fr: Les instances Amazon Web Services (AWS) peuvent également être gérées à partir de cette interface.

source: In the **User report** pop-up window, each line represents a different instance, where you can see their technical features and the hourly quota consumption.
fr_fr: Dans la fenêtre pop-up **Rapport utilisateur**, chaque ligne représente une instance différente, où vous pouvez voir leurs caractéristiques techniques et la consommation horaire de quotas.

source: You can select the **Trashcan** icon to stop an instance.
fr_fr: Vous pouvez sélectionner l'icône **Corbeille** pour arrêter une instance.

source: If the process you launched is a long computation (e.g. the **BFAST application** or any **Change detection algorithm**) and you want to close the SEPAL window, you can run the process in the background.
fr_fr: Si le processus que vous avez lancé est un long calcul (par ex. l'application **BFAST** ou n'importe quel **algorithme de détection de changement**) et vous voulez fermer la fenêtre SEPAL, vous pouvez exécuter le processus en arrière-plan.

source: Select **Edit** to open the **Instance** pop-up window, where the slider bar displays the amount of time remaining before your instance will be shut down. Increase this value for the estimated duration of your process and you can then safely close the SEPAL browser tab.
fr_fr: Sélectionnez **Modifier** pour ouvrir la fenêtre pop-up **Instance**, où la barre de curseur affiche le temps restant avant que votre instance ne soit arrêtée. Augmentez cette valeur pour la durée estimée de votre processus et vous pourrez ensuite fermer l'onglet navigateur SEPAL en toute sécurité.

source: If you increase the lifespan of your instance, it will continue to consume your quota. Check regularly that your process is running effectively to avoid losing resources.
fr_fr: Si vous augmentez la durée de vie de votre instance, elle continuera à consommer votre quota. Vérifiez régulièrement que votre processus fonctionne efficacement pour éviter de perdre des ressources.

source: Request resources
fr_fr: Demander des ressources

source: From the **Resource manager**, select **Request additional resources**.
fr_fr: Dans le **gestionnaire de ressources**, sélectionnez **Demander des ressources supplémentaires**.

source: In order for your request to be considered, you must:
fr_fr: Pour que votre demande soit prise en considération, vous devez :

source: Change the quota to values that meet your needs (e.g. more storage and fewer instances). The values entered are suggestions that the administrator will be able to change, if needed. (1)
fr_fr: Changez le quota en valeurs qui répondent à vos besoins (par exemple plus de stockage et moins d'instances). Les valeurs saisies sont des suggestions que l'administrateur pourra modifier, si nécessaire. (1)

source: Provide an extensive explanation for why you need these resources, as well as the project name, the type of analysis and the area of interest (AOI). (2)
fr_fr: Fournissez une explication détaillée pour expliquer pourquoi vous avez besoin de ces ressources. ainsi que le nom du projet, le type d'analyse et le domaine d'intérêt (AOI). (2)

source: Once validated, the request is sent to the SEPAL team, who will take measures in the coming days to update your profile, which may include contacting you directly if they need any extra details.
fr_fr: Une fois validée, la demande est envoyée à l'équipe SEPAL qui prendra des mesures dans les prochains jours pour mettre à jour votre profil, qui peuvent comprendre de vous contacter directement pour plus de détails.

source: For support, `ask the community <https://groups.google.com/g/sepal-users>`__.
fr_fr: Pour obtenir de l'aide, `demandez à la communauté <https://groups.google.com/g/sepal-users>`__.
