Repository: openforis/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/cookbook/index.po
Languages: fr_fr

source: SEPAL recipes
fr_fr: Recettes SEPAL

source: Harness high-performance cloud-based computing and modern geospatial data infrastructures with SEPAL recipes.
fr_fr: Exploiter les Exploitez les infrastructures de données géospatiales modernes et basées sur le cloud hautes performances avec les recettes SEPAL.

source: Overview
fr_fr: Aperçu

source: SEPAL recipes are the main feature of the platform and offer users the ability to quickly and efficiently query and process satellite data, tailor their products for local needs, and produce sophisticated and relevant geospatial analyses.
fr_fr: Les recettes SEPAL sont la caractéristique principale de la plateforme et offrent aux utilisateurs la possibilité d'interroger et de traiter rapidement et efficacement les données satellitaires adapter leurs produits aux besoins locaux et produire des analyses géospatiales sophistiquées et pertinentes.

source: A SEPAL recipe is a record of the steps and parameters used to make a dataset (e.g. optical mosaic, radar mosaic, classification, etc.). The recipe can be saved, with the same data recreated on-the-fly whenever needed or used in further analyses. A recipe is not, in itself, data. Using SEPAL recipes enables documentation of the parameters and steps used to create mosaics, composites, classifications, time series and other datasets or information products. SEPAL recipes, once saved, are available in the SEPAL interface after you sign in to the platform. Recipes can be run, deleted, or copied (e.g. to change the sensor used, while leaving all other parameters the same).
fr_fr: Une recette SEPAL est un enregistrement des étapes et des paramètres utilisés pour créer un jeu de données (par exemple, mosaïque optique, mosaïque radar, classification, etc.). La recette peut être sauvegardée, avec les mêmes données recréées à la volée chaque fois que nécessaire ou utilisées dans des analyses plus approfondies. L'utilisation des recettes SEPAL permet de documenter les paramètres et les étapes utilisés pour créer des mosaïques, des composites, des classifications, des séries temporelles et d'autres jeux de données ou produits d'information. Les recettes SEPAL, une fois enregistrées, sont disponibles dans l'interface SEPAL après avoir ouvert une session sur la plate-forme. Les recettes peuvent être exécutées, supprimées ou copiées (par exemple, pour modifier le capteur utilisé, tout en laissant identiques tous les autres paramètres).

source: With recipes, you can access the Google Earth Engine (GEE) multi-petabyte catalog of satellite imagery and utilize their planetary-scale analysis capabilities without writing a single line of code, simply by linking your Google and SEPAL accounts.
fr_fr: Avec des recettes, vous pouvez accéder au catalogue Google Earth Engine (GEE) multi-petabyte d'imagerie satellite et utiliser leurs capacités d'analyse planétaire sans écrire une seule ligne de code, simplement en liant vos comptes Google et SEPAL.

source: Gallery
fr_fr: Galerie

source: Start a recipe
fr_fr: Commencer une recette

source: Connect your SEPAL account to your GEE account to read and write GEE assets. If your accounts are not linked, you will only be able to download data to your SEPAL workspace.
fr_fr: Connectez votre compte SEPAL à votre compte GEE pour lire et écrire des assets GEE. Si vos comptes ne sont pas liés, vous ne pourrez télécharger que des données dans votre espace de travail SEPAL.

source: To start a recipe, go to the **Process** tab :icon:`fa-solid fa-globe`, where you'll see the list of all saved recipes in your SEPAL account.
fr_fr: Pour commencer une recette, allez dans l'onglet **Processus** :icon:`fa-solid fa-globe`, où vous verrez la liste de toutes les recettes enregistrées dans votre compte SEPAL.

source: Select the green :icon:`fa-solid fa-circle-plus` button in the lower-right corner to open the **Recipe type selector** pop-up window. Select any of the available recipe types and follow our tutorials to learn more about each type's usage.
fr_fr: Sélectionnez le bouton vert :icon:`fa-solid fa-circle-plus` dans le coin inférieur droit pour ouvrir la fenêtre pop-up **Type de recettes**. Sélectionnez l'un des types de recettes disponibles et suivez nos tutoriels pour en savoir plus sur l'utilisation de chaque type.

source: Save a recipe
fr_fr: Enregistrer une recette

source: Using saved recipes is the recommended method for sharing parameters to developers when debugging.
fr_fr: Utiliser des recettes sauvegardées est la méthode recommandée pour partager les paramètres avec les développeurs lors du débogage.

source: Select a recipe in the main menu to display it in a tab. Then select :btn:`<fa-solid fa-bars>` in the upper-right corner and select :btn:`Export recipe`. The file will be downloaded to your computer using the following name: :code:`<name_of_the_recipe>.json.zip`.
fr_fr: Sélectionnez une recette dans le menu principal pour l'afficher dans un onglet. Ensuite, sélectionnez :btn:`<fa-solid fa-bars>` dans le coin supérieur droit et sélectionnez :btn:`recette d'exportation`. Le fichier sera téléchargé sur votre ordinateur en utilisant le nom suivant : :code:`<name_of_the_recipe>.json.zip`.

source: Recipes
fr_fr: Recettes

source: For support, `ask the community <https://groups.google.com/g/sepal-users>`__.
fr_fr: Pour obtenir de l'aide, `demandez à la communauté <https://groups.google.com/g/sepal-users>`__.
